PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_sysclk_v2.c
    if (divider <= (PERI_GR_CLOCK_CTL_INT8_DIV_Msk >> PERI_GR_CLOCK_CTL_INT8_DIV_Pos))
    {
        CY_REG32_CLR_SET(PERI_GR_CLOCK_CTL(instNum, groupNum), PERI_GR_CLOCK_CTL_INT8_DIV, divider);
        retVal = CY_SYSCLK_SUCCESS;
    }

    return retVal;
}


uint32_t Cy_SysClk_PeriGroupGetDivider(uint32_t groupNum)
{
    uint8_t instNum = (uint8_t)(((uint32_t)groupNum & PERI_GR_INST_NUM_Msk) >> PERI_GR_INST_NUM_Pos);

    groupNum = (uint8_t)(groupNum & CY_SYSCLK_PERI_GR_NUM_Msk);

    CY_ASSERT_L1(instNum < PERI_INSTANCE_COUNT);
    CY_ASSERT_L1(groupNum < CY_PERI_GROUP_NR);

    return (_FLD2VAL(PERI_GR_CLOCK_CTL_INT8_DIV, PERI_GR_CLOCK_CTL(instNum, groupNum)));
}

cy_en_sysclk_status_t Cy_SysClk_PeriGroupSetSlaveCtl(uint32_t groupNum, cy_en_peri_grp_sl_ctl_num_t slaveCtl, uint32_t value)
{
    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;
    uint8_t instNum = (uint8_t)(((uint32_t)groupNum & PERI_GR_INST_NUM_Msk) >> PERI_GR_INST_NUM_Pos);

    groupNum = (uint8_t)(groupNum & CY_SYSCLK_PERI_GR_NUM_Msk);

    CY_ASSERT_L1(instNum < PERI_INSTANCE_COUNT);
    CY_ASSERT_L1(groupNum  < CY_PERI_GROUP_NR);
    CY_ASSERT_L1(CY_SYSCLK_IS_SL_CTL_NUM_VALID(slaveCtl));

    switch (slaveCtl)
    {
    case CY_SYSCLK_PERI_GROUP_SL_CTL:
        PERI_GR_SL_CTL(instNum, groupNum) = value;
        retVal = CY_SYSCLK_SUCCESS;
        break;
#if defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS)
    case CY_SYSCLK_PERI_GROUP_SL_CTL2:
        PERI_GR_SL_CTL2(instNum, groupNum) = value;
        retVal = CY_SYSCLK_SUCCESS;
        break;
    case CY_SYSCLK_PERI_GROUP_SL_CTL3:
        /* Writes not allowed on SL_CTL3 */
        retVal = CY_SYSCLK_BAD_PARAM;
        break;
#endif
    default:
        retVal = CY_SYSCLK_BAD_PARAM;
        break;
    }

    return retVal;
}


uint32_t Cy_SysClk_PeriGroupGetSlaveCtl(uint32_t groupNum, cy_en_peri_grp_sl_ctl_num_t slaveCtl)
{
    uint32_t retVal = 0;
    uint8_t instNum = (uint8_t)(((uint32_t)groupNum & PERI_GR_INST_NUM_Msk) >> PERI_GR_INST_NUM_Pos);

    groupNum = (uint8_t)(groupNum & CY_SYSCLK_PERI_GR_NUM_Msk);

    CY_ASSERT_L1(instNum < PERI_INSTANCE_COUNT);
    CY_ASSERT_L1(groupNum < CY_PERI_GROUP_NR);
    CY_ASSERT_L1(CY_SYSCLK_IS_SL_CTL_NUM_VALID(slaveCtl));

    switch (slaveCtl)
    {
    case CY_SYSCLK_PERI_GROUP_SL_CTL:
        retVal = PERI_GR_SL_CTL(instNum, groupNum);
        break;
#if defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS)
    case CY_SYSCLK_PERI_GROUP_SL_CTL2:
        retVal = PERI_GR_SL_CTL2(instNum, groupNum);
        break;
    case CY_SYSCLK_PERI_GROUP_SL_CTL3:
        retVal = PERI_GR_SL_CTL3(instNum, groupNum);
        break;
#endif
    default:
        retVal = (uint32_t)CY_SYSCLK_BAD_PARAM;
        break;
    }

    return retVal;
}

bool Cy_SysClk_IsPeriGroupSlaveCtlSet(uint32_t groupNum, cy_en_peri_grp_sl_ctl_num_t slaveCtl, uint32_t slaveMsk)
{
    bool retVal = false;
    uint8_t instNum = (uint8_t)(((uint32_t)groupNum & PERI_GR_INST_NUM_Msk) >> PERI_GR_INST_NUM_Pos);

    groupNum = (uint8_t)(groupNum & CY_SYSCLK_PERI_GR_NUM_Msk);


    CY_ASSERT_L1(instNum < PERI_INSTANCE_COUNT);
    CY_ASSERT_L1(groupNum < CY_PERI_GROUP_NR);
    CY_ASSERT_L1(CY_SYSCLK_IS_SL_CTL_NUM_VALID(slaveCtl));

    switch (slaveCtl)
    {
    case CY_SYSCLK_PERI_GROUP_SL_CTL:
        if ((PERI_GR_SL_CTL(instNum, groupNum) & slaveMsk) != 0UL)
        {
            retVal = true;
        }
        break;
#if defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS)
    case CY_SYSCLK_PERI_GROUP_SL_CTL2:
        if ((PERI_GR_SL_CTL2(instNum, groupNum) & slaveMsk) != 0UL)
        {
            retVal = true;
        }
        break;
    case CY_SYSCLK_PERI_GROUP_SL_CTL3:
        if ((PERI_GR_SL_CTL3(instNum, groupNum) & slaveMsk) != 0UL)
        {
            retVal = true;
        }
        break;
#endif
    default:
        CY_ASSERT_L2(false);
        break;
    }

    return retVal;
}

#if  defined (CY_IP_MXS22SRSS)
void Cy_SysClk_PeriGroupSlaveInit(uint32_t periNum, uint32_t groupNum, uint32_t slaveNum, uint32_t clkHfNum)
{
    CY_ASSERT_L1(periNum < PERI_INSTANCE_COUNT);
    CY_ASSERT_L1(groupNum  < CY_PERI_GROUP_NR);
    CY_ASSERT_L1(clkHfNum < CY_SRSS_NUM_HFROOT);
    CY_ASSERT_L1(slaveNum < 32U);

    if (false == Cy_SysClk_ClkHfIsEnabled(clkHfNum))
    {
        (void)Cy_SysClk_ClkHfEnable(clkHfNum);         /* Suppress a compiler warning about unused return value */
    }

    /* Release reset for the IP */
    PERI_GR_SL_CTL2(periNum, groupNum) &= ~(0x1UL << slaveNum);

    /* Enable IP */
    PERI_GR_SL_CTL(periNum, groupNum) |= (0x1UL << slaveNum);
}

void Cy_SysClk_PeriGroupSlaveDeinit(uint32_t periNum, uint32_t groupNum, uint32_t slaveNum)
{
    CY_ASSERT_L1(periNum < PERI_INSTANCE_COUNT);
    CY_ASSERT_L1(groupNum  < CY_PERI_GROUP_NR);
    CY_ASSERT_L1(slaveNum < 32U);

    /* Release reset for the IP */
    PERI_GR_SL_CTL(periNum, groupNum) &= ~(0x1UL << slaveNum);
}

bool Cy_SysClk_IsPeriGroupSlaveEnabled(uint32_t periNum, uint32_t groupNum, uint32_t slaveNum)
{
    CY_ASSERT_L1(periNum < PERI_INSTANCE_COUNT);
    CY_ASSERT_L1(groupNum  < CY_PERI_GROUP_NR);
    CY_ASSERT_L1(slaveNum < 32U);

    return (((PERI_GR_SL_CTL(periNum, groupNum) & (0x1UL << slaveNum)) != 0U) ? true : false);
}

#endif


/* ========================================================================== */
/* =========================    clk_fast SECTION    ========================= */
/* ========================================================================== */

#if defined (CY_IP_MXS40SRSS) && defined (CY_IP_M7CPUSS)

uint32_t Cy_SysClk_ClkFastSrcGetFrequency(uint32_t clkFastNum)
{
    uint32_t freq = Cy_SysClk_ClkHfGetFrequency(CY_SYSCLK_CLK_FAST_HF_NUM); /* Get root frequency */
    uint32_t integer = 0UL;        /* Integer part of peripheral divider */
    uint32_t locFrac;
    uint32_t locDiv;
    uint64_t locFreq = freq * 32ULL;

    Cy_SysClk_ClkFastSrcGetDivider(clkFastNum, &integer, &locFrac);
    /* For fractional dividers, the divider is (int + 1) + frac/32 */
    locDiv = ((1UL + integer) * 32UL) + locFrac;

