PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_sysclk_v2.c
/* DPLL-HP pdf range selection */
#define CY_SYSCLK_DPLL_HP_MIN_PDF         (17000UL)
#define CY_SYSCLK_DPLL_HP_MAX_PDF         (50000UL)

/* DPLL-HP input and output frequency limits */
#define CY_SYSCLK_DPLL_HP_MIN_IN_FREQ  (4000000UL)
#define CY_SYSCLK_DPLL_HP_MAX_IN_FREQ  (50000000UL)
#define CY_SYSCLK_DPLL_HP_MIN_OUT_FREQ (50000000UL)
#define CY_SYSCLK_DPLL_HP_MAX_OUT_FREQ (400000000UL)

/* DPLL-HP default config values */
#define CY_SYSCLK_DPLL_HP_CONFIG2_FREQ_MODE_SEL_CODE  (CY_SYSCLK_DPLL_HP_CLK50MHZ_1US_CNT_VAL)
#define CY_SYSCLK_DPLL_HP_CONFIG2_IVR_TRIM            (0x8U)
#define CY_SYSCLK_DPLL_HP_CONFIG3_CLKR_SEL            (true)

#define CY_SYSCLK_DPLL_HP_CONFIG4_LF_LC_ALPHA         (0xCU)
#define CY_SYSCLK_DPLL_HP_CONFIG4_LF_LC_BETA          (0x5U)

#define CY_SYSCLK_DPLL_HP_CONFIG4_FLOCK_EN_TH3        (0x3U)
#define CY_SYSCLK_DPLL_HP_CONFIG4_FLOCK_EN_TH7        (0x7U)

#define CY_SYSCLK_DPLL_HP_CONFIG4_FLOCK_WAITPER       (0x6U)
#define CY_SYSCLK_DPLL_HP_CONFIG4_LK_TH               (0x7U)
#define CY_SYSCLK_DPLL_HP_CONFIG4_LK_WAITPER          (0x8U)

#define CY_SYSCLK_DPLL_HP_CONFIG5_LF_ALPHA            (0x14U)
#define CY_SYSCLK_DPLL_HP_CONFIG5_LF_BETA             (0x14U)
#define CY_SYSCLK_DPLL_HP_CONFIG5_LF_SET_PARAMS       (true)

#define CY_SYSCLK_DPLL_HP_DUTY_CAL_CTL_DC_EN          (true)


#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2)) || defined(CY_IP_MXS22SRSS) || (defined (CY_IP_MXS40SSRSS) && (SRSS_NUM_TOTAL_PLL > 0UL))

#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2))

/* Only include PLL400M functions for devices that contain PLL400M IP. */
#if defined (CY_SRSS_PLL400M_PRESENT) && (CY_SRSS_PLL400M_PRESENT == 1u)
bool Cy_SysClk_Pll400MIsEnabled(uint32_t pllNum)
{
    CY_UNUSED_PARAMETER(pllNum);
#if defined (CY_SRSS_PLL400M_PRESENT) && (CY_SRSS_PLL400M_PRESENT == 1u)
    CY_ASSERT_L1(pllNum < CY_SRSS_NUM_PLL400M);
    return (_FLD2BOOL(CLK_PLL400M_CONFIG_ENABLE, SRSS_CLK_PLL_400M_CONFIG(pllNum)));
#else
    return false;
#endif
}


bool Cy_SysClk_Pll400MLocked(uint32_t pllNum)
{
    CY_UNUSED_PARAMETER(pllNum);
#if defined (CY_SRSS_PLL400M_PRESENT) && (CY_SRSS_PLL400M_PRESENT == 1u)
    CY_ASSERT_L1(pllNum < CY_SRSS_NUM_PLL400M);
    return (_FLD2BOOL(CLK_PLL400M_STATUS_LOCKED, SRSS_CLK_PLL_400M_STATUS(pllNum)));
#else
    return false;
#endif
}


bool Cy_SysClk_Pll400MLostLock(uint32_t pllNum)
{
    CY_UNUSED_PARAMETER(pllNum);
#if defined (CY_SRSS_PLL400M_PRESENT) && (CY_SRSS_PLL400M_PRESENT == 1u)
    CY_ASSERT_L1(pllNum < CY_SRSS_NUM_PLL400M);

    bool retVal = _FLD2BOOL(CLK_PLL400M_STATUS_UNLOCK_OCCURRED, SRSS_CLK_PLL_400M_STATUS(pllNum));
    /* write a 1 to clear the unlock occurred bit */
    SRSS_CLK_PLL_400M_STATUS(pllNum) = CLK_PLL400M_STATUS_UNLOCK_OCCURRED_Msk;
    return (retVal);
#else
    return false;
#endif
}


cy_en_sysclk_status_t Cy_SysClk_Pll400MDisable(uint32_t pllNum)
{
    CY_UNUSED_PARAMETER(pllNum);
#if defined (CY_SRSS_PLL400M_PRESENT) && (CY_SRSS_PLL400M_PRESENT == 1u)

    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;

    CY_ASSERT_L1(pllNum < CY_SRSS_NUM_PLL400M);

    /* First bypass PLL */
    CY_REG32_CLR_SET(SRSS_CLK_PLL_400M_CONFIG(pllNum), CLK_PLL400M_CONFIG_BYPASS_SEL, CY_SYSCLK_FLLPLL_OUTPUT_INPUT);
    /* Wait at least 6 PLL clock cycles */
    Cy_SysLib_DelayUs(1U);
    /* And now disable the PLL itself */
    SRSS_CLK_PLL_400M_CONFIG(pllNum) &= ~CLK_PLL400M_CONFIG_ENABLE_Msk;
    retVal = CY_SYSCLK_SUCCESS;

    return (retVal);
#else
    return CY_SYSCLK_UNSUPPORTED_STATE;
#endif
}


cy_en_sysclk_status_t Cy_SysClk_Pll400MConfigure(uint32_t pllNum, const cy_stc_pll_config_t *config)
{
    CY_UNUSED_PARAMETER(pllNum);
    CY_UNUSED_PARAMETER(config);

#if defined (CY_SRSS_PLL400M_PRESENT) && (CY_SRSS_PLL400M_PRESENT == 1u)

    cy_en_sysclk_status_t retVal = CY_SYSCLK_SUCCESS;

    CY_ASSERT_L1(pllNum < CY_SRSS_NUM_PLL400M);

    if (((config->inputFreq)  < CY_SYSCLK_PLL400M_MIN_IN_FREQ)  || (CY_SYSCLK_PLL400M_MAX_IN_FREQ  < (config->inputFreq)) ||
            ((config->outputFreq) < CY_SYSCLK_PLL400M_MIN_OUT_FREQ) || (CY_SYSCLK_PLL400M_MAX_OUT_FREQ < (config->outputFreq)))
    {
        retVal = CY_SYSCLK_BAD_PARAM;
    }
    else
    {
        cy_stc_pll_manual_config_t manualConfig = {0U, 0U, 0U, false, CY_SYSCLK_FLLPLL_OUTPUT_AUTO, 0, false, false, 0, 0, false};

        /* If output mode is not bypass (input routed directly to output), then
           calculate new parameters. */
        if (config->outputMode != CY_SYSCLK_FLLPLL_OUTPUT_INPUT)
        {
            /* for each possible value of OUTPUT_DIV and REFERENCE_DIV (Q), try
               to find a value for FEEDBACK_DIV (P) that gives an output frequency
               as close as possible to the desired output frequency. */
            uint32_t p, q, out;
            uint32_t foutBest = 0UL; /* to ensure at least one pass through the for loops below */

            /* REFERENCE_DIV (Q) selection */
            for (q = CY_SYSCLK_PLL400M_MIN_REF_DIV; q <= CY_SYSCLK_PLL400M_MAX_REF_DIV; q++)
            {
                /* FEEDBACK_DIV (P) selection */
                for (p = CY_SYSCLK_PLL400M_MIN_FB_DIV; p <= CY_SYSCLK_PLL400M_MAX_FB_DIV; p++)
                {
                    /* Calculate the intermediate Fvco, and make sure that it's in range */
                    uint32_t fvco = (uint32_t)(((uint64_t)(config->inputFreq) * (uint64_t)p) / (uint64_t)q);
                    if ((CY_SYSCLK_PLL400M_MIN_FVCO <= fvco) && (fvco <= CY_SYSCLK_PLL400M_MAX_FVCO))
                    {
                        /* OUTPUT_DIV selection */
                        for (out = CY_SYSCLK_PLL400M_MIN_OUTPUT_DIV; out <= CY_SYSCLK_PLL400M_MAX_OUTPUT_DIV; out++)
                        {
                            uint64_t tempVco = ((uint64_t)config->outputFreq) * ((uint64_t)out);
                            uint64_t tempFeedBackDivLeftShifted = ((tempVco << (uint64_t)SRSS_PLL400M_FRAC_BIT_COUNT) * (uint64_t)q) / (uint64_t)config->inputFreq;
                            volatile uint32_t feedBackFracDiv  = (uint32_t)(tempFeedBackDivLeftShifted & ((1ULL << (uint64_t)SRSS_PLL400M_FRAC_BIT_COUNT) - 1ULL));
                            /* Calculate what output frequency will actually be produced.
                               If it's closer to the target than what we have so far, then save it. */
                            uint32_t fout = (uint32_t)((((uint64_t)config->inputFreq * (((uint64_t)p << SRSS_PLL400M_FRAC_BIT_COUNT) + (uint64_t)feedBackFracDiv)) / ((uint64_t)q * (uint64_t)out)) >> SRSS_PLL400M_FRAC_BIT_COUNT);

                            if ((uint32_t)abs((int32_t)fout - (int32_t)(config->outputFreq)) <
                                    (uint32_t)abs((int32_t)foutBest - (int32_t)(config->outputFreq)))
                            {
                                if (foutBest == (config->outputFreq))
                                {
                                    break;
                                }

                                foutBest = fout;
                                manualConfig.feedbackDiv  = (uint8_t)p;
                                manualConfig.referenceDiv = (uint8_t)q;
                                manualConfig.outputDiv    = (uint8_t)out;
                                manualConfig.fracEn       = (feedBackFracDiv != 0UL);
                                manualConfig.fracDiv      = feedBackFracDiv;
                            }
                        }
                    }
                }
            }
            /* exit loops if foutBest equals outputFreq */

