PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_sysclk_v2.c
/* DPLL-HP */
#if defined(CY_IP_MXS22SRSS) || defined(CY_DOXYGEN)
bool Cy_SysClk_DpllHpIsEnabled(uint32_t pllNum)
{
    CY_UNUSED_PARAMETER(pllNum);
#if (CY_SRSS_DPLL_HP_PRESENT)
    CY_ASSERT_L1(pllNum < SRSS_NUM_DPLL_HP);
    return (_FLD2BOOL(CLK_DPLL_HP_CONFIG_ENABLE, SRSS_CLK_DPLL_HP_CONFIG(pllNum)));
#else
    return false;
#endif
}


bool Cy_SysClk_DpllHpLocked(uint32_t pllNum)
{
    CY_UNUSED_PARAMETER(pllNum);
#if (CY_SRSS_DPLL_HP_PRESENT)
    CY_ASSERT_L1(pllNum < SRSS_NUM_DPLL_HP);
    return (_FLD2BOOL(CLK_DPLL_HP_STATUS_LOCKED, SRSS_CLK_DPLL_HP_STATUS(pllNum)));
#else
    return false;
#endif
}


bool Cy_SysClk_DpllHpLostLock(uint32_t pllNum)
{
    CY_UNUSED_PARAMETER(pllNum);
#if (CY_SRSS_DPLL_HP_PRESENT)
    CY_ASSERT_L1(pllNum < SRSS_NUM_DPLL_HP);

    bool retVal = _FLD2BOOL(CLK_DPLL_HP_STATUS_UNLOCK_OCCURRED, SRSS_CLK_DPLL_HP_STATUS(pllNum));
    /* write a 1 to clear the unlock occurred bit */
    SRSS_CLK_DPLL_HP_STATUS(pllNum) = CLK_DPLL_HP_STATUS_UNLOCK_OCCURRED_Msk;
    return (retVal);
#else
    return false;
#endif
}


cy_en_sysclk_status_t Cy_SysClk_DpllHpDisable(uint32_t pllNum)
{
    CY_UNUSED_PARAMETER(pllNum);
#if (CY_SRSS_DPLL_HP_PRESENT)

    cy_en_sysclk_status_t retVal = CY_SYSCLK_BAD_PARAM;

    CY_ASSERT_L1(pllNum < SRSS_NUM_DPLL_HP);

    /* First bypass PLL */
    CY_REG32_CLR_SET(SRSS_CLK_DPLL_HP_CONFIG(pllNum), CLK_DPLL_HP_CONFIG_BYPASS_SEL, CY_SYSCLK_FLLPLL_OUTPUT_INPUT);
    /* Wait at least 6 PLL clock cycles */
    Cy_SysLib_DelayUs(1U);
    /* And now disable the PLL itself */
    SRSS_CLK_DPLL_HP_CONFIG(pllNum) &= ~CLK_DPLL_HP_CONFIG_ENABLE_Msk;
    retVal = CY_SYSCLK_SUCCESS;

    return (retVal);
#else
    return CY_SYSCLK_UNSUPPORTED_STATE;
#endif
}

__STATIC_INLINE cy_en_wait_mode_select_t Cy_SysClk_DpllHpGetFreqMode(uint32_t inputFreq)
{
    cy_en_wait_mode_select_t freqMode = CY_SYSCLK_DPLL_HP_CLK50MHZ_1US_CNT_VAL;

    if ((inputFreq > 45000000U) && (inputFreq <= 50000000U))
    {
        freqMode = CY_SYSCLK_DPLL_HP_CLK50MHZ_1US_CNT_VAL;
    }
    else if ((inputFreq > 40000000U) && (inputFreq <= 45000000U))
    {
        freqMode = CY_SYSCLK_DPLL_HP_CLK45MHZ_1US_CNT_VAL;
    }
    else if ((inputFreq > 32000000U) && (inputFreq <= 40000000U))
    {
        freqMode = CY_SYSCLK_DPLL_HP_CLK40MHZ_1US_CNT_VAL;
    }
    else if ((inputFreq > 25000000U) && (inputFreq <= 32000000U))
    {
        freqMode = CY_SYSCLK_DPLL_HP_CLK30MHZ_1US_CNT_VAL;
    }
    else if ((inputFreq > 16000000U) && (inputFreq <= 25000000U))
    {
        freqMode = CY_SYSCLK_DPLL_HP_CLK20MHZ_1US_CNT_VAL;
    }
    else if ((inputFreq > 10000000U) && (inputFreq <= 16000000U))
    {
        freqMode = CY_SYSCLK_DPLL_HP_CLK15MHZ_1US_CNT_VAL;
    }
    else if ((inputFreq > 6000000U) && (inputFreq <= 10000000U))
    {
        freqMode = CY_SYSCLK_DPLL_HP_CLK10MHZ_1US_CNT_VAL;
    }
    else if ((inputFreq > 4000000U) && (inputFreq <= 6000000U))
    {
        freqMode = CY_SYSCLK_DPLL_HP_CLK4MHZ_1US_CNT_VAL;
    }
    else
    {
        freqMode = CY_SYSCLK_DPLL_HP_CLK50MHZ_1US_CNT_VAL;
    }

    return freqMode;
}

__STATIC_INLINE uint8_t Cy_SysClk_DpllHpGetFlockTh(uint32_t nDiv)
{
    uint8_t flockEnTh;

    if (nDiv < 20U)
    {
        flockEnTh = 0x3U;
    }
    else
    {
        flockEnTh = 0x7U;
    }

    return flockEnTh;
}

__STATIC_INLINE uint8_t Cy_SysClk_DpllHpGetLfBeta(uint32_t inputFreq, uint32_t pDiv)
{
    uint8_t lfBeta;
    uint32_t pfd = inputFreq / (pDiv + 1U);

    if (pfd < 25000000U)
    {
        lfBeta = 0x10U;
    }
    else
    {
        lfBeta = 0x14U;
    }

    return lfBeta;
}

cy_en_sysclk_status_t Cy_SysClk_DpllHpConfigure(uint32_t pllNum, const cy_stc_pll_config_t *config)
{
    CY_UNUSED_PARAMETER(pllNum);
    CY_UNUSED_PARAMETER(config);

#if (CY_SRSS_DPLL_HP_PRESENT)

    cy_en_sysclk_status_t retVal = CY_SYSCLK_SUCCESS;

    CY_ASSERT_L1(pllNum < SRSS_NUM_DPLL_HP);

    if (((config->inputFreq)  < CY_SYSCLK_DPLL_HP_MIN_IN_FREQ)  || (CY_SYSCLK_DPLL_HP_MAX_IN_FREQ  < (config->inputFreq)) ||
            ((config->outputFreq) < CY_SYSCLK_DPLL_HP_MIN_OUT_FREQ) || (CY_SYSCLK_DPLL_HP_MAX_OUT_FREQ < (config->outputFreq)))
    {
        retVal = CY_SYSCLK_BAD_PARAM;
    }
    else
    {
        cy_stc_dpll_hp_config_t    DpllHpConfig = (cy_stc_dpll_hp_config_t)
        {
            0
        };
        cy_stc_pll_manual_config_t manualConfig = {NULL, &DpllHpConfig};

        /* If output mode is not bypass (input routed directly to output), then
           calculate new parameters. */
        if (config->outputMode != CY_SYSCLK_FLLPLL_OUTPUT_INPUT)
        {
            /* for each possible value of NDIV(nDiv) and PDIV(pDiv), try
               to find a value for KDIV (kDiv) that gives an output frequency
               as close as possible to the desired output frequency. */
            uint32_t pDiv, kDiv, nDiv;
            uint32_t foutBest = 0UL; /* to ensure at least one pass through the for loops below */

            /* PDIV (pDiv) selection */
            for (pDiv = CY_SYSCLK_DPLL_HP_MIN_PDIV; pDiv <= CY_SYSCLK_DPLL_HP_MAX_PDIV; pDiv++)
            {
                /* NDIV (nDiv) selection */
                for (nDiv = CY_SYSCLK_DPLL_HP_MIN_NDIV; nDiv <= CY_SYSCLK_DPLL_HP_MAX_NDIV; nDiv++)
                {
                    uint32_t pdf = (uint32_t)((uint32_t)(config->inputFreq / 1000U) / (uint32_t)(pDiv));
                    uint32_t fdco = (uint32_t)((uint32_t)(pdf) * (uint32_t)(nDiv));
                    if (((CY_SYSCLK_DPLL_HP_MIN_FDCO <= fdco) && (fdco <= CY_SYSCLK_DPLL_HP_MAX_FDCO))  && ((CY_SYSCLK_DPLL_HP_MIN_PDF <= pdf) && (pdf <= CY_SYSCLK_DPLL_HP_MAX_PDF)))
                    {
                        /* KDIV (kDiv) selection */
                        for (kDiv = CY_SYSCLK_DPLL_HP_MIN_KDIV; kDiv <= CY_SYSCLK_DPLL_HP_MAX_KDIV; kDiv++)
                        {
                            uint64_t tempVco = ((uint64_t)config->outputFreq) * ((uint64_t)kDiv);
                            uint64_t tempFeedBackDivLeftShifted = ((tempVco << (uint64_t)SRSS_DPLL_HP_FRAC_BIT_COUNT) * (uint64_t)pDiv) / (uint64_t)config->inputFreq;
                            volatile uint32_t feedBackFracDiv  = (uint32_t)(tempFeedBackDivLeftShifted & ((1ULL << (uint64_t)SRSS_DPLL_HP_FRAC_BIT_COUNT) - 1ULL));
                            /* Calculate what output frequency will actually be produced.
                               If it's closer to the target than what we have so far, then save it. */
                            uint32_t fout = (uint32_t)((((uint64_t)config->inputFreq * (((uint64_t)nDiv << SRSS_DPLL_HP_FRAC_BIT_COUNT) + (uint64_t)feedBackFracDiv)) / ((uint64_t)pDiv * (uint64_t)kDiv)) >> SRSS_DPLL_HP_FRAC_BIT_COUNT);

