PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_sysclk_v2.c
    return 0;
#endif
}
#endif /* defined (CY_IP_MXS40SSRSS) */

/* ========================================================================== */
/* ======================    POWER MANAGEMENT SECTION    ==================== */
/* ========================================================================== */


/** \cond INTERNAL */
/* Timeout count for use in function Cy_SysClk_DeepSleepCallback() is sufficiently large for ~1 second */
#define TIMEOUT (1000000UL)
/** \endcond */

cy_en_syspm_status_t Cy_SysClk_DeepSleepCallback(cy_stc_syspm_callback_params_t * callbackParams, cy_en_syspm_callback_mode_t mode)
{
    cy_en_syspm_status_t retVal = CY_SYSPM_FAIL;

    /* Suppress "not used" warning */
    CY_UNUSED_PARAMETER(callbackParams);
    CY_UNUSED_PARAMETER(clkCounting);

    switch (mode)
    {
    case CY_SYSPM_CHECK_READY:
        /* Don't allow entry into Deep Sleep mode if currently measuring a frequency */
        if (!clkCounting)
        {
            /* Indicating that we can go into Deep Sleep.
             * Prevent starting a new clock measurement until
             * after we've come back from Deep Sleep.
             */
            preventCounting = true;
            retVal = CY_SYSPM_SUCCESS;
        }
        break;

    case CY_SYSPM_CHECK_FAIL:
        /* Cancellation of going into Deep Sleep, therefore allow a new clock measurement */
        preventCounting = false;
        retVal = CY_SYSPM_SUCCESS;
        break;

    case CY_SYSPM_BEFORE_TRANSITION:
        retVal = CY_SYSPM_SUCCESS;
        break;

    case CY_SYSPM_AFTER_TRANSITION:
        preventCounting = false; /* Allow clock measurement */
        break;

    default: /* Unsupported mode, return CY_SYSPM_FAIL */
        break;
    }

    CY_UNUSED_PARAMETER(clkCounting); /* Suppress a compiler warning about unused variables */

    return (retVal);

}


/** \cond INTERNAL */
/* Value to indicate invalid HF NUM */
#define CY_SYSCLK_INVALID_HF_NUM (0xFFFFFFFFUL)
/** \endcond */
CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 18.1', 5, \
                             'Suppressing taking true and false branch.')
uint32_t Cy_Sysclk_PeriPclkGetClkHfNum(uint32_t ipBlock)
{
#if (defined (CY_IP_MXS40SRSS) && (defined (CY_IP_MXPERI) && (CY_IP_MXPERI_VERSION < 3U)))
    /* MXPERI versions 1 & 2 do not use peri groups, this function is not compatible with PERI ver2. */
    CY_UNUSED_PARAMETER(ipBlock);
    return CY_SYSCLK_INVALID_HF_NUM;
#else

    uint32_t grpNum = (ipBlock & PERI_PCLK_GR_NUM_Msk) >> PERI_PCLK_GR_NUM_Pos;
    uint32_t instNum = (uint8_t)((ipBlock & PERI_PCLK_INST_NUM_Msk) >> PERI_PCLK_INST_NUM_Pos);

    if (grpNum >= PERI_PCLK_GR_NUM(instNum))
    {
        return CY_SYSCLK_INVALID_HF_NUM;
    }

#if defined (CY_IP_MXPERI) && (CY_IP_MXPERI_VERSION >= 3)
    uint32_t peri0GrpToHfArray[] = { PERI0_PCLK_GR_NUM_0_CLK_HF_NUM,
                                     PERI0_PCLK_GR_NUM_1_CLK_HF_NUM,
                                   };
#elif (defined (CY_IP_MXS40SSRSS) && (SRSS_NUM_TOTAL_PLL > 0UL))
    uint32_t peri0GrpToHfArray[] = { PERI0_PCLK_GR_NUM_0_CLK_HF_NUM,
                                     PERI0_PCLK_GR_NUM_1_CLK_HF_NUM,
                                     PERI0_PCLK_GR_NUM_2_CLK_HF_NUM,
                                     PERI0_PCLK_GR_NUM_3_CLK_HF_NUM,
                                     PERI0_PCLK_GR_NUM_4_CLK_HF_NUM,
                                     PERI0_PCLK_GR_NUM_5_CLK_HF_NUM,
                                     PERI0_PCLK_GR_NUM_6_CLK_HF_NUM
                                   };
#elif defined (CY_IP_MXS22SRSS)
    uint32_t peri0GrpToHfArray[PERI0_PCLK_GROUP_NR] = { PERI0_PCLK_GR_NUM_0_CLK_HF_NUM,
                                                        PERI0_PCLK_GR_NUM_1_CLK_HF_NUM,
                                                        PERI0_PCLK_GR_NUM_2_CLK_HF_NUM,
                                                        PERI0_PCLK_GR_NUM_3_CLK_HF_NUM,
                                                        PERI0_PCLK_GR_NUM_4_CLK_HF_NUM,
                                                        PERI0_PCLK_GR_NUM_5_CLK_HF_NUM,
                                                        PERI0_PCLK_GR_NUM_6_CLK_HF_NUM,
                                                        PERI0_PCLK_GR_NUM_7_CLK_HF_NUM,
                                                        PERI0_PCLK_GR_NUM_8_CLK_HF_NUM,
                                                        PERI0_PCLK_GR_NUM_9_CLK_HF_NUM,
                                                      };
#else
    uint32_t peri0GrpToHfArray[] = { PERI0_PCLK_GR_NUM_0_CLK_HF_NUM,
                                     PERI0_PCLK_GR_NUM_1_CLK_HF_NUM,
                                     PERI0_PCLK_GR_NUM_2_CLK_HF_NUM,
                                     PERI0_PCLK_GR_NUM_3_CLK_HF_NUM,
                                     PERI0_PCLK_GR_NUM_4_CLK_HF_NUM,
                                     PERI0_PCLK_GR_NUM_5_CLK_HF_NUM,
                                     PERI0_PCLK_GR_NUM_6_CLK_HF_NUM
                                   };
#endif

#if defined (CY_IP_MXS22SRSS)
    uint32_t peri1GrpToHfArray[PERI1_PCLK_GROUP_NR] = { PERI1_PCLK_GR_NUM_0_CLK_HF_NUM,
                                                        PERI1_PCLK_GR_NUM_1_CLK_HF_NUM,
                                                        PERI1_PCLK_GR_NUM_2_CLK_HF_NUM,
                                                        PERI1_PCLK_GR_NUM_3_CLK_HF_NUM,
                                                        PERI1_PCLK_GR_NUM_4_CLK_HF_NUM,
                                                        PERI1_PCLK_GR_NUM_5_CLK_HF_NUM,
                                                      };
#endif

#if defined (CY_IP_MXS22SRSS)
    if (0UL == instNum)
    {
        return peri0GrpToHfArray[grpNum];
    }
    else
    {
        return peri1GrpToHfArray[grpNum];
    }
#else
    return peri0GrpToHfArray[grpNum];
#endif
#endif
}

uint32_t Cy_SysClk_PeriPclkGetFrequency(en_clk_dst_t ipBlock, cy_en_divider_types_t dividerType, uint32_t dividerNum)
{
    uint32_t integer = 0UL;        /* Integer part of peripheral divider */
    uint32_t freq = 0UL;
    uint32_t grpNum = 0UL;
    uint32_t instNum = 0UL;
    uint32_t hfNum = CY_SYSCLK_INVALID_HF_NUM;
#if defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2)
    uint32_t peri_div = 1UL + (uint32_t)Cy_SysClk_ClkPeriGetDivider();
#endif
#if defined (CY_IP_MXPERI) && (CY_IP_MXPERI_VERSION <= 2)
    hfNum = 0UL;
#else
    grpNum = (((uint32_t)ipBlock) & PERI_PCLK_GR_NUM_Msk) >> PERI_PCLK_GR_NUM_Pos;
    instNum = (uint8_t)(((uint32_t)ipBlock & PERI_PCLK_INST_NUM_Msk) >> PERI_PCLK_INST_NUM_Pos);

#if defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2)
    peri_div = (grpNum == 0UL) ? (1UL + (uint32_t)Cy_SysClk_ClkPeriGetDivider()) : 1U;
#endif

    CY_ASSERT_L1(instNum < PERI_INSTANCE_COUNT);
    CY_ASSERT_L1(grpNum < PERI_PCLK_GR_NUM(instNum));

